Repository: adballar/BitSafe
Catalog: localizations/bitsafe/*.po
Languages: italian

source: No persistent storage partition found. I will now start the BitSafe storage format utility.
italian: Nessuna partizione di memorizzazione trovata. Lancio il tool di formattazione per crearne una.

source: Enter user password
italian: Inserire la password utente

source: Please enter the user password for the screen locking feature. It can and it SHOULD be different from the secure storage partition password.
italian: Prego inserire la password per il blocco dello schermo. Può e DOVREBBE essere diversa rispetto alla password della partizione di memorizzazione.

source: bitsafe-format-storage <options> Creates the storage partition on the current device (if needed), wipes and installs a luks volume on it, then formats it with EXT4. Options: -u Leave the cryptdevice mapping when cleaning -h this help
italian: bitsafe-format-storage <opzioni> Crea la partizione di memorizzazione sul dispositivo attuale (se necessario), azzera e crea un volume luks e infine formatta con ext4. Opzioni: -u Non chiude il mapping di cryptdevice alla chiusura -h Questo aiuto

source: BITSAFE FORMAT STORAGE TOOL
italian: FORMATTATORE DELLO STORAGE

source: I can't unmount the storage partition. Please make sure that bitcoin, ssh and gpg are closed, and wait untill the USB drive is idle (the LED stops blinking). if this keeps happening, you may have to reboot bitsafe.
italian: Non posso smontare la partizione di memorizzazione. Prego asiscurarsi che bitcoin, ssh e gpg siano chiusi, e attendere sino a che il dispositivo di storage è in idle (il LED non luccica). Se continua a ripresentarsi, può essere necessario riavviare bitsafe.

source: It appears that there's already a storage partition on this disk. After the format, everything you have on the storage partition is going to be removed from the disk permanently. This includes the bitcoin wallet and the SSH and GPG private keys, be sure you don't have any bitcoin on the wallet, and if you do be sure you have a fully functional backup. Let me put this clear: YOU _WILL_ LOSE ALL THE BITCOIN STORED IF YOU DON'T HAVE A BAKUP!!!! Please enter uppercase yes if you are absolutely sure you want to continue.
italian: Sembra esserci già una partizione di memorizzazione su questo disco. Dopo la formattazione, qualunque cosa attualmente presente su tale partizione verrà cancellata irrimediabilmente. Ciò include il portafolgio bitcoin e le chiavi SSH e GPG. Prego assicurarsi che non ci siano bitcoin su tale portafoglio o, qualora ci fossero, assicurarsi di avere un backup completo e funzionale. Ribadisco: PERDERAI _IRRIMEDIABILMENTE_ QUALUNQUE BITCOIN TU ABBIA NELLO STORAGE SE NON HAI UN BACKUP!!! Scrivi yes in maiuscolo per continuare con la formattazione.

source: * Deleting partition %s
italian: * Cancello la partizione %s

source: Error while deleting the storage partition. Is the media in read-only mode?
italian: Errore durante la rimozione della partizione. Il dispositivo è im modalità di sola lettura?

source: No storage partition found on the current drive. If this is the first time you are running BitSafe from this device there's nothing you should be worried about, and you can safely continue.
italian: Nessuna partizione di storage rilevata sul dispositivo corrente. Se questa è la prima volta che bitsafe viene avviato su questo dispositivo, non c'è nulla di cui preoccuparsi e puoi continuare.

source: You wish to continue? (y/n)
italian: Vuoi continuare? (y/n)

source: * Checking available space
italian: * Controllo lo spazio disponibile

source: The device you are running bitsafe from is too small. It needs at least %s GB of storage space.
italian: Il dispositivo su cui sta girando bitcoin è troppo piccolo. Deve avere almeno %s GB disponibili.

source: * Creating a partition on %s from %s MB to %s MB
italian: * Creo una partizione su %s da %s MB a %s MB

source: Partition creator (parted) returned error! Is the device set on read-only mode perhaps?
italian: Il partizionatore (parte) ha dato un errore. Il dispositivo si trova in modalità di sola lettura?

source: The partition was created but the OS doesn't detect it. Try to reboot and retry.
italian: La partizione è stata creata, ma l'OS non la rileva. Prova a riavviare.

source: * Filling the storage partition with random data from %s
italian: * Riempio la partizione di memorizzazione con dati casuali da %s

source: This can take up to 20 minutes, please wait...
italian: Possono essere necessari fino a 20 minuti, attendere...

source: Error while filling data with dd. Looks like your storage device is broken.
italian: errore durante il riempimento. Pare che il dispositivo di memorizzazione sia rotto.

source: * Setting up encryption
italian: * Imposto la cifratura

source: Please enter the new password for the crypted storage.
italian: Prego inserire la password per la cifratura dei dati.

source: Please re-enter the password to proceed with the format.
italian: Prego reinserire la password per procedere con la formattazione

source: Failed to decrypt the storage partition.
italian: Errore durante la decifratura della partizione di memorizzazione

source: * Decrypted. Launching format. This can take up to few minutes, please wait...
italian: * Decifrato, inizio la formattazione. Può essere necessario qualche minuto, attendere...

source: Format returned error! Probably something is wrong with your storage device.
italian: La formattazione ha dato un'errore. Probabilmente c'è qualcosa che non va col dispositivo di memorizzazione.

source: Can't remount the formatted partition!!! USB issue?
italian: Non posso rimontare la partizione formattata!!! Problema con l'USB?

source: Error while setting up the partition permissions. Really a weird error.
italian: Errore durante l'impostazione dei permessi. È un'errore molto strano.

source: Creation succesful!
italian: Creazione completata!

source: You need the persistent storage partition mounted to launch this program.
italian: Per usare quest'applicazione è necessario montare la partizione di memorizzazione.

source: C R I T I C A L E R R O R
italian: E R R O R E C R I T I C O

source: This script requires superuser privileges. Try using sudo.
italian: Questa script richiede privilegi di superutente. Riprova con sudo.

source: I can't get the device i'm running from. This is really a weird error. You should probably reinstall the bitsafe image and start all over.
italian: Non riesco a rilevare il dispositivo da cui sto girando. È un'errore molto strano. Potrebbe essere necessario reinstallare l'immagine di bitsafe e ricominciare da capo.

source: Press ENTER to continue
italian: Premere INVIO per continuare

source: bitsafe-mount-storage <options> Mounts the persistent storage partition (if any), requesting the partition password. Can work both in graphical and terminal mode. The Graphical mode is enabled by default if the script is launched not interactively and the display environment variable is defined. You can change this with option flags. Options: -m <mountp> Mounts in a given mountpoint, overriding default -g Forces GUI behavior -t Forces terminal-style behavior -q Suppress all output -h this help
italian: bitsafe-mount-storage <opzioni> Monta la partizione di memorizzazione (se presente), richiedendone la password per la decifratura. Può funzionare sia in modo grafico che testuale. La modalità graica è attiva di default se la script non è lanciata in modo interattivo e la variabile d'ambiente DISPLAY è settata. Si può forzare la modalità con le opzioni. Opzioni: -m <mountp> Monta nella posizione indicata, ignorando il default -g Forza la modalità grafica -t Forza la modalità testuale -q Silenzia tutto l'output -h Questo aiuto

source: Couldn't get current display.
italian: Non rilevo il display corrente

source: Storage directory is already mounted.
italian: La partizione di memorizzazione è già montata.

source: No storage partition found. You can setup one with the function 'Format Storage'.
italian: Nessuna partizione di memorizzazione trovata. È possibile crearne una con la funzione 'Formatta Storage'.

source: Enter Password
italian: Immetti la Password

source: Please enter the password to decipher persistent storage partition:
italian: Prego immettere la password per decifrare la partizione di memorizzazione.

source: User cancelled
italian: Cancellato dall'utente

source: Could not decipher the storage partition! Possibile reasons: * The partition cration was stopped. * You powered off or unplugged the drive in a bad moment. * The USB drive got broken or corrupt. * Someone or something messed with your USB drive. If you can't go past this point even after a reboot, then you probably lost everything you had on the storage partition, including the bitcoin wallet. Oh snaps! You've got a backup, don't you? You can reset the storage with the function Format Storage in the system menu.
italian: Non è possibile decifrare la partizione di memorizzazione! Possibili motivi: * La formattazione è stata interrotta. * Il PC è stato arrestato malamente in un brutto momento. * qualcuno o qualcosa ha alterato il dispositivo USB. Se non riesci ad andare oltre questo errore nemmeno dopo un reboot, allora probabilmente qualcunque cosa contenuta nella chiavetta è persa. Ma hai un backup, vero? È possibile resettare la partizione di memorizzazione con la funzione 'Formatta Storage' presente nel menù di sistema.

source: It looks like you don't remember the password. If you forgot it, there's nothing you can do to recover your data. If you have a backup, you can wipe the storage partition and enter a new password. If you haven't a backup... Well, you should have thought before. The command to wipe the storage partition is Format Storage, located in the system menu
italian: troppi errori di password. Se la password è stata dimenticata, non c'è modo di ripristinarla. Se hai un backup puoi resettare la partizione di memorizzazione e inserire una nuova password. Se non hai un backup... Beh, avresti dovuto pensarci prima. Il comando per resettare la partizione di memorizzazione è 'Formatta Storage', che si trova nel menu di sistema.

source: Storage partition already uncrypted and mapped, skipping decrypting
italian: La partizione di memorizzazione è già decifrata, salto decifratura.

source: First mount try failed. Forcing fsck.
italian: Primo tentativo di mount fallito. Forzo fsck.

source: I managed to decipher the storage partition, but the mount failed even after a fsck. This can have happened due to an improper shutdown. Be happy, there is a good chance that you'll be able to recover your wallet.dat file. I'm leaving the partition uncrypted, the path is %s. Copy it on some media and hand it over to some nerd who knows how to extract data from damaged ext4 file system, if you can't do it yourself. Good luck! :)
italian: Ho decifrato la partizione di storage, ma il mount ha fallito anche dopo un fsck. Ciò può essere dovuto ad un arresto improprio. Allegro, ci sono buone possibilità che tu possa recuperare il tuo file portafolgio (wallet.dat). Lascio la partizione decifrata, la posizione è %s. Copialo su qualche supporto e dallo a qualche nerd che sa come Recuperare dati da un file system ext4 corrotto, se non lo sai fare. Buona fortuna! :)

source: Mount failed for an unknown error. Please try mounting manually.
italian: Il mount è fallito per ragioni sconosciute. Prova manualmente.

source: Storage partition active
italian: Storage attivo

source: Persistent storage has been deciphered and mounted.
italian: La partizione di memorizzazione è stata decifrata e montata.

source: bitsafe-umount-storage <options> Umounts the persistent partition storage and closes the luks mapping, securing it. Can work both in graphical and terminal mode. The Graphical mode is enabled by default if the script is launched not interactively and the display environment variable is defined. You can change this with option flags. Options: -u Unmount, but skip unmapping (leave crypted partition uncrypted) -g Forces GUI behavior -t Forces terminal-style behavior -q Suppress all output -h this help
italian: bitsafe-umount-storage <opzioni> Smonta la partizione di memorizzazione e chiude il mapping luks, mettendola in sicurezza. Può funzionare sia in modo grafico che testuale. La modalità graica è attiva di default se la script non è lanciata in modo interattivo e la variabile d'ambiente DISPLAY è settata. Si può forzare la modalità con le opzioni. Opzioni: -u Smonta ma non chiudere il mapping (lascia la Partizione decifrata. -g Forza modalità grafica -t Forza modalità testuale -q Silenzia tutto l'output -h Questo aiuto

source: Error while unmounting storage.
italian: Errore durante l'unmounting della partizione di memorizzazione.

source: The storage partition is in use by these programs: %s Close them before trying to unmount.
italian: La partizione di memorizzazione è in uso da: %s Chiudi i programmi riportati sopra per smontare.

source: Storage partition is not mounted.
italian: La partizione di memorizzazione non è montata.

source: Error while unmounting storage mounted in %s
italian: Errore durante l'unmouunting dell partizione montata in %s

source: Error while closing luks device %s
italian: Errore mentre chiudevo il dispositivo luks %s

source: Storage partition deactivated
italian: Storage disattivato

source: Persistent storage has been unmounted and secured.
italian: La partizione di memorizzazione è stata smontata e messa in sicurezza.

source: This will download and install the iceweasel browser for this session only. Do you wish to continue?
italian: Questo scaricherà ed intallerà il browser Iceweasel solamente per questa sessione.Vuoi proseguire?

source: Installing Iceweasel failed! Please check that you are connected to the internet, wait a couple of minutes and try again.
italian: Installazione di Icewesel fallita! Controlla di essere collegato ad internet, aspetta un paio di minuti e ritenta.

source: Bitcoin is starting up
italian: Avvio di bitcoin in corso

source: Bitcoin is starting for the first time on this media. It will take some time to build up its environment, please wait...
italian: Bitcoin è stato avviato per la prima volta su questo dispositivo. Ci vorrà del tempo per costruirne l'ambiente di lavoro, attendere...
